xserein12339/Smart-Access-System/software_engineering/firmware/components/pal/host_test/sdkconfig.defaults
# PAL host_test 配置 — linux 目标 + Unity Fixture 模式
CONFIG_IDF_TARGET="linux"
CONFIG_IDF_TARGET_LINUX=y
CONFIG_UNITY_ENABLE_IDF_TEST_RUNNER=n
CONFIG_UNITY_ENABLE_FIXTURE=y
